{
    "articles":[
        {"id":"1","title":"Trading week overview (06.1.25- 10.1.25)","content":"<div> <h4>News</h4> <p>🟠 German Prelim CPI m/m will be released on Monday, a value higher than the previous one could trigger a rise in the euro.</p> <p>🟠 On tuesday we will see the release of the U.S. services price index and new jobs statistics.</p> <p>🟠 On Wednesday, Australia's CPI will be released.🔴 And a little later we have Non Farm Payroll and the Fed announcement.</p> <p>🔴 On Friday, the unemployment rate for the U.S. and Canada will be released.</p> <h4>Current trades</h4> <p> I came out with a profit from the EURUSD sell trade (1.0456 “ 1.0290). Nothing has changed from a fundamental point of view, just waiting for a technical pullback and breakdown of the institutional level for the next trade. </p> <p>Holding a sell for NZDUSD</p> <h4>Ideas</h4> <p> No new ideas. </p> </div>"},
        {"id":"2","title":"Trading week overview (30.12.24 - 3.1.25)","content":"<div> <p>A quiet week for statistics on New Year's Eve - the PMI is coming out, and it's expected to be flat, so for the Aussie and New Zealand the situation is the same, and they will continue to fall against the dollar, January 2 will be released data on unemployment claims in the U.S., and the number of claims is expected to rise, can momentarily weaken the dollar, and also on Friday will be published the U.S. producer price index, experts do not expect any changes here either.</p> <h4>Current trades</h4> <p> I continue to sell Euro against the US dollar and also started selling New Zealand against the US dollar. </p> <h4>Ideas</h4> <p> No new ideas. </p> </div> </div>"},
        {"id":"3","title":"Trading week overview (23.12.24 - 27.12.24)","content":"<p>First, next trading week is a holiday week for the US and Europe. There will still be some activity on Monday, such as the release of Canada's GDP. It is expected to rise from 0.1% to 0.2%.</p> <p> On Wednesday will be a press conference of the Bank of Japan, also on Japan will be statistics on consumer prices in Tokyo, which is expected to rise from 2.2% to 2.5%, which again should only strengthen the BOJ's view on the need for a rate hike. (And result in an appreciation of the yen, which should be positive for my euro vs. yen trade - the ECB is cutting rates, and we expect the BOJ to raise rates in January). </p> <p> Also on Thursday we will see the US unemployment statistics. </p> <h4>Open postions</h4> <p> <b>EURUSD Sell</b><br> ECB lowered the rate, I'm staying on the market </p> <p> <b>EURJPY Sell</b><br> Unfortunately BOJ has kept the rate unchanged, for now I will stay in position until January, hopefully, for more rumors of a rate hike in 2025. </p> <h4>Ideas</h4> <p> <b>NZDUSD</b><br> It is still worth selling the New Zealand Dollar against the US Dollar. It's a great dynamic to sell, the rate has been falling for three weeks, the rate is 4.25 vs. 4.50 at the fed, and the GDP data for the third quarter didn't please either, which will further encourage the Bank of New Zealand to cut rates. </p> </div> </div>"},
        {"id":"4","title":"Trading week overview (16.12.24 - 20.12.24)","content":"<div> <p>What I'm most interested in next week is not the Euro inflation data, oddly enough, although it should confirm last week's ECB rate cut, but the U.S. rate on Wednesday, which is expected by experts should be cut by 25 bps. 4.75>4.50, and BOJ, which is also due to issue a rate decision earlier also on Wednesday. </p> <p> <b>USDCAD</b><br> USDCAD can be bought on a pullback, Canada had weak labor market data last week, and the dollar is strengthening despite the fact that traders expect a rate cut next year, possibly even in December (https://www.cmegroup.com/markets/interest-rates/cme-fedwatch-tool.html). On the other hand, the instability in Syria will raise oil prices, which will have a positive impact on the Canadian dollar. </p> <h4>Open postions</h4> <p> <b>EURUSD Sell</b><br> The imbalance in rates speaks for itself still, and the ECB rate cut last week supports the idea that the euro is weakening against the dollar. </p> <p> <b>EURJPY Sell</b><br> The JPY should rather strengthen against the USD, everyone expects a rate hike or a rate cut from BOJ. A rate hike is much more realistic now, after the Fed lowered its weaker dollar. <a href=\"https://tradingeconomics.com/japan/currency\" target=\"_blank\">Source link</a> </p> <h4>Ideas</h4> <p> <b>NZDUSD</b><br> I like the look of the NZDUSD from a technical point of view. And it looks like the New Zealand Central Bank is thinking about about cutting rates all next year, and it's 4.25. <br> <i>Markets currently see a 66% chance of a 50bps cut at the central bank’s February meeting, with rates projected to drop to around 3.10% by the end of 2025. On the economic data front, New Zealand’s manufacturing sector contracted further in November (45.5 vs 45.8 in October), marking its lowest level in four months. </i> <a href=\"https://tradingeconomics.com/new-zealand/currency\" target=\"_blank\">Source link</a> </p> </div>"},
        {"id":"5","title":"Trend Strength Index","content":"<div><b>Trend Strength Index</b> - is an indicator that shows the strength of the market. In essence, it is similar to a simplified autoregressive indicator because the correlation function calculates the Pearson correlation coefficient between two sets of data: Closing prices and bar indices at a specified length. This coefficient ranges from -1 to 1, indicating the strength and direction of the linear relationship between bar index and bar closing price. <br> <div class='imagecontainer'><img style=\"width: 700px;\" src=\"https://c.mql5.com/18/156/727641391177.png\"></div> <br> <b>Interpretation:</b> <ul> <li>A value around 1 indicates a strong uptrend with little deviation from the mean.</li> <li>A value around -1 indicates a strong downtrend with small deviations from the mean.</li> <li>A value near 0 means that a flat is possible.</li> </ul> <br> <a href=\"https://www.mql5.com/en/code/51255\" target=\"_blank\">Link to mql5.com</a>"}
    ]
}